ДоставкаЗаказов/src/AccumulationRegisters/ПробегТранспорта/ПробегТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПробегТранспорта</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Рейсы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачальныйПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДоставкаЗаказов/src/AccumulationRegisters/ПробегТранспорта/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ПробегТранспорта(Транспорт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПробегТранспортаОбороты.РасстояниеОборот КАК Пробег
		|ИЗ
		|	РегистрНакопления.ПробегТранспорта.Обороты(,,, Транспорт = &Транспорт) КАК ПробегТранспортаОбороты";
	
	Запрос.УстановитьПараметр("Транспорт", Транспорт);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		НачальныйПробег	= 0;
		Возврат НачальныйПробег;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	НачальныйПробег 	= ВыборкаДетальныеЗаписи.Пробег;

	Возврат НачальныйПробег; 
	
КонецФункции

#КонецОбласти

#КонецЕсли
